export const abilities = [
  {
    name: "せいでんき",
    flavorText: "さわった　あいてを\nまひさせる　ことがある。",
    description:
      "直接攻撃を受けると、30%の確率で相手を『まひ』状態にする。/『でんき』タイプの野生のポケモンと出会いやすくなる。(第8世代まで)",
  },
  {
    name: "ひらいしん",
    flavorText: "でんきを　よびこんで\nとくこうを　あげる。",
    description:
      "『でんき』タイプの技を受けるとダメージが無効化され、自分の『とくこう』ランクが1段階上がる。またダブルバトルの時、自分以外の全てのポケモンの『でんき』タイプの単体攻撃技の攻撃対象が自分になる。(攻撃対象が複数の技の場合はそのまま)/『でんき』タイプの野生のポケモンと出会いやすくなる(第8世代のみ)。",
  },
  {
    name: "もらいび",
    flavorText: "ほのおを　うけると\nほのおわざが　つよくなる。",
    description:
      "『ほのお』タイプの技を受けるとダメージや効果はなくなり、以後自分の『ほのお』タイプの技の威力が1.5倍になる。/『ほのお』タイプの野生のポケモンと出会いやすくなる(第8世代のみ)。",
  },
  {
    name: "ほのおのからだ",
    flavorText: "ふれた　あいてを　やけど\nさせることがある。",
    description:
      "直接攻撃を受けると、30%の確率で相手を『やけど』状態にする。/『てもち』にいると、ポケモンのタマゴが2倍かえりやすくなる。(必要な歩数が半分になる)",
  },
  {
    name: "すりぬけ",
    flavorText: "あいての　かべを\nすりぬけて　こうげき。",
    description:
      "相手の『オーロラベール』『リフレクター』『ひかりのかべ』『しろいきり』『しんぴのまもり』『みがわり』の効果を受けない。/野生のポケモンと出会いにくくなる(第8世代のみ)。",
  },
  {
    name: "がんじょう",
    flavorText: "いちげきで\nたおされない。",
    description:
      "HPが最大の時、『ひんし』状態になるダメージを受けても必ず1残る。また、一撃で『ひんし』になる技『じわれ』『ぜったいれいど』『つのドリル』『ハサミギロチン』を受けない。",
  },
  {
    name: "いしあたま",
    flavorText: "ぶつかっても\nはんどうを　うけない。",
    description:
      "技『アフロブレイク』『ウッドハンマー』『じごくぐるま』『すてみタックル』『とっしん』『フレアドライブ』『ブレイブバード』『ボルテッカー』『もろはのずつき』『ワイルドボルト』『ウェーブタックル』『クロロブラスト』の反動を受けない。技『わるあがき』の反動は受ける。",
  },
  {
    name: "びびり",
    flavorText: "びびって　すばやさが\nあがる　タイプがある。",
    description:
      "『ゴースト』『むし』『あく』タイプの技を受けた時、『すばやさ』ランクが1段階上がる。第8世代からは、相手の特性『いかく』で『こうげき』が下がった時にも発動する。",
  },
  {
    name: "だっぴ",
    flavorText: "じょうたい　いじょうを\nなおす　ことがある。",
    description: "ターンごとに1/3の確率で状態異常が治る。",
  },
];
